[
  {
    "title": "Шахматная задача",
    "content": "Заданы две клетки шахматной доски. Напишите программу, которая определяет имеют ли указанные клетки один цвет или нет. Если они покрашены в один цвет, то выведите слово YES, а если в разные цвета — то NO.",
    "user_id": 1
  },
  {
    "title": "Ход слона",
    "content": "Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли слон попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES, если из первой клетки ходом слона можно попасть во вторую или NO в противном случае.",
    "user_id": 2
  },
  {
    "title": "Координаты черепашки",
    "content": "Группа биологов в институте биоинформатики завела себе черепашку. После дрессировки черепашка научилась понимать и запоминать указания биологов следующего вида: север 10 запад 20 юг 30 восток 40, где первое слово — это направление, в котором должна двигаться черепашка, а число после слова — это положительное расстояние в сантиметрах, которое должна пройти черепашка. Но команды даются быстро, а черепашка ползёт медленно, и программисты догадались, что можно написать программу, которая определит, куда в итоге биологи приведут черепашку. Для этого программисты просят вас написать программу, которая выведет точку, в которой окажется черепашка после всех команд. Для простоты они решили считать, что движение начинается в точке (0, 0), и движение на восток увеличивает первую координату, а на север — вторую.",
    "user_id": 1
  },
  {
    "title": "Словари в Python",
    "content": "На мобильных кнопочных телефонах текстовые сообщения можно отправлять с помощью цифровой клавиатуры. Поскольку с каждой клавишей связано несколько букв, для большинства букв требуется несколько нажатий клавиш. При однократном нажатии цифры генерируется первый символ, указанный для этой клавиши. Нажатие цифры 2, 3, 4 или 5 раз генерирует второй, третий, четвертый или пятый символ клавиши. Напишите программу, которая отображает нажатия клавиш, необходимые для введенного сообщения.",
    "user_id": 3
  },
  {
    "title": "Объединение словарей",
    "content": "Дополните приведенный код так, чтобы он объединил содержимое двух словарей dict1 и dict2 по ключам, складывая значения по одному и тому же ключу, в случае, если ключ присутствует в обоих словарях. Результирующий словарь необходимо присвоить переменной result.",
    "user_id": 1
  },
  {
    "title": "Код Морзе",
    "content": "Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе. На вход программе подается одна строка – текстовое сообщение. Программа должна вывести закодированное с помощью кода Морзе сообщение, оставляя пробел между каждым закодированным символом (последовательностью тире и точек).",
    "user_id": 2
  },
  {
	"title": "Список животных",
	"content": "Вам доступен список pets, содержащий информацию о собаках и их владельцах.  Каждый элемент списка – это кортеж вида (кличка собаки, имя владельца, фамилия владельца, возраст владельца). Дополните приведенный код так, чтобы в переменной result хранился словарь, в котором для каждого владельца будут перечислены его собаки. Ключом словаря должен быть кортеж (имя, фамилия, возраст владельца), а значением – список кличек собак (сохранив исходный порядок следования).",
	"user_id": 1
  },
  {
	"title": "Самое редкое слово",
	"content": "На вход программе подается строка текста. Напишите программу, которая выводит слово, которое встречается реже всего, без учета регистра. Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.",
	"user_id": 3
  },
  {
	"title": "Минимальное и максимальное числа",
	"content": "Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное, потом минимальное, после чего оставшееся число. На ввод могут подаваться и повторяющиеся числа.",
	"user_id": 2
  },
  {
	"title": "Високосный год",
	"content": "Требуется определить, является ли данный год високосным. Напомним, что високосными годами считаются те годы, порядковый номер которых либо кратен 4, но при этом не кратен 100, либо кратен 400 (например, 2000-й год являлся високосным, а 2100-й будет невисокосным годом). Программа должна корректно работать на числах 1900 ≤ n ≤ 3000. Выведите Високосный в случае, если считанный год является високосным и Обычный в обратном случае (не забывайте проверять регистр выводимых программой символов).",
	"user_id": 1
  }, 
  {
	"title": "Пирог",
	"content": "В Институте биоинформатики между информатиками и биологами устраивается соревнование. Победителям соревнования достанется большой и вкусный пирог. В команде биологов a человек, а в команде информатиков — b человек. Нужно заранее разрезать пирог таким образом, чтобы можно было раздать кусочки пирога любой команде, выигравшей соревнование, при этом каждому участнику этой команды должно достаться одинаковое число кусочков пирога. И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число. Напишите программу, которая помогает найти это число. Программа должна считывать размеры команд (два положительных целых числа a и b, каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится на оба этих числа без остатка.",
	"user_id": 1
  },
  {
	"title": "Таблица умножения",
	"content": "Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения. Напишите программу, на вход которой даются четыре числа a, b, c и d, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a; b] на все числа отрезка [c; d]. Числа a, b, c и d являются натуральными и не превосходят 10, a ≤ b, c ≤ d.",
	"user_id": 3
  },
  {
	"title": "Среднее арифметическое из интервала",
	"content": "Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a; b], которые кратны числу 3. На вход программе подаются интервалы, внутри которых всегда есть хотя бы одно число, которое делится на 3.﻿",
	"user_id": 2
  },
  {
	"title": "GC-состав",
	"content": "GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности. Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть от регистра вводимых символов).",
	"user_id": 1
  },  
  {
	"title": "Алгоритм сжатия",
	"content": "Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке. Кодирование осуществляется следующим образом: s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки. Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.",
	"user_id": 1
  },
  {
	"title": "Поврежденный XML-файл",
	"content": "Иванов отправил файл с сохраненной XML-строкой по электронной почте своему коллеге Петрову. Однако, к сожалению, файл повредился в процессе пересылки: ровно один символ в строке заменился на некоторый другой символ. Требуется написать программу, которая по строке, которую получил Петров, восстановит исходную XML-строку, которую отправлял Иванов. Входной файл INPUT.TXT содержит одну строку, которая заменой ровно одного символа может быть превращена в корректную XML-строку. Длина строки лежит в пределах от 7 до 1000, включительно. Строка содержит только строчные буквы английского алфавита и символы '<' (ASCII код 60), '>' (ASCII код 62) и '/' (ASCII код 47). Строка во входном файле заканчивается переводом строки. Выходной файл OUTPUT.TXT должен содержать корректную XML-строку, которая может быть получена из строки во входном файле заменой ровно одного символа на другой. Если вариантов ответа несколько, можно вывести любой.",
    "user_id": 3
  },
  {
	"title": "Дифференцированные выплаты",
	"content": "Рассчитать ежемесячную сумму платежа по кредиту при использовании дифференцированных выплат (в этом случае ежемесячный платеж по погашению кредита постепенно уменьшается к концу периода кредитования). Сумма кредита составляет s рублей, срок кредита n месяцев, процент - k%.",
	"user_id": 2
  },
  {
	"title": "Поиск символов в строке",
	"content": "Напомним, что строковый метод find('a') возвращает местоположение первого вхождения символа a в строке. Проблема заключается в том, что данный метод не находит местоположение всех символов а. Напишите функцию с именем find_all(target, symbol), которая принимает два аргумента: строку target и символ symbol и возвращает список, содержащий все местоположения этого символа в строке. Примечание. Если указанный символ не встречается в строке, то следует вернуть пустой список.",
	"user_id": 3
  }     
]